using AutoLot.Dal.Tests.Base;

namespace AutoLot.Dal.Tests.IntegrationTests;

// В зависимости от возможностей средства запуска тестов тесты xUnit выполняются
// последовательно внутри тестовой оснастки (класса), но параллельно во всех тестовых оснастках (классах).
// Это может оказаться проблематичным при прогоне интеграционных тестов, взаимодействующих с единственной базой данных.
// Выполнение можно сделать последовательным для всех тестовых оснасток, добавив их в одну и ту же тестовую коллекцию.
// Тестовые коллекции определяются по имени с применением атрибута [Collection] к классу.

[Collection("Integration Tests")]
public class CarTests : BaseTest, IClassFixture<EnsureAutoLotDatabaseTestFixture>
{
    
}